Процедура ПересоздатьМенеджер() Экспорт
    Менеджер = Новый МенеджерВременныхТаблиц;
    Продюсер = Новый Запрос;
    Продюсер.МенеджерВременныхТаблиц = Менеджер;
    Продюсер.Текст = "ВЫБРАТЬ Ссылка ПОМЕСТИТЬ ВТ_Менеджер ИЗ Справочник.Номенклатура";
    Продюсер.Выполнить();
    Менеджер = Новый МенеджерВременныхТаблиц;
    Потребитель = Новый Запрос;
    Потребитель.МенеджерВременныхТаблиц = Менеджер;
    Потребитель.Текст = "ВЫБРАТЬ Ссылка ИЗ ВТ_Менеджер";
    Результат = Потребитель.Выполнить();
КонецПроцедуры
