Процедура CompileSibling() Экспорт
    Менеджер = Новый МенеджерВременныхТаблиц;
#Если Сервер Тогда
    Продюсер = Новый Запрос;
    Продюсер.МенеджерВременныхТаблиц = Менеджер;
    Продюсер.Текст = "ВЫБРАТЬ Ссылка ПОМЕСТИТЬ ВТ_Compile ИЗ Справочник.Номенклатура";
    Продюсер.Выполнить();
#Иначе
    Потребитель = Новый Запрос;
    Потребитель.МенеджерВременныхТаблиц = Менеджер;
    Потребитель.Текст = "ВЫБРАТЬ Ссылка ИЗ ВТ_Compile";
    Результат = Потребитель.Выполнить();
#КонецЕсли
КонецПроцедуры
