Функция SameBranchChain(Условие) Экспорт
    Менеджер = Новый МенеджерВременныхТаблиц;
    Если Условие Тогда
        Продюсер = Новый Запрос;
        Продюсер.МенеджерВременныхТаблиц = Менеджер;
        Продюсер.Текст = "ВЫБРАТЬ Ссылка ПОМЕСТИТЬ ВТ_ОднаВетка ИЗ Справочник.Номенклатура";
        Продюсер.Выполнить();
        Потребитель = Новый Запрос;
        Потребитель.МенеджерВременныхТаблиц = Менеджер;
        Потребитель.Текст = "ВЫБРАТЬ Ссылка ИЗ ВТ_ОднаВетка";
        Результат = Потребитель.Выполнить();
        Возврат Результат;
    КонецЕсли;
    Возврат Неопределено;
КонецФункции
