Функция MultilineIfSibling(Условие1, Условие2) Экспорт
    Менеджер = Новый МенеджерВременныхТаблиц;
    Если Условие1
        И Условие2 Тогда
        Продюсер = Новый Запрос;
        Продюсер.МенеджерВременныхТаблиц = Менеджер;
        Продюсер.Текст = "ВЫБРАТЬ Ссылка ПОМЕСТИТЬ ВТ_MultiIf ИЗ Справочник.Номенклатура";
        Продюсер.Выполнить();
    Иначе
        Потребитель = Новый Запрос;
        Потребитель.МенеджерВременныхТаблиц = Менеджер;
        Потребитель.Текст = "ВЫБРАТЬ Ссылка ИЗ ВТ_MultiIf";
        Результат = Потребитель.Выполнить();
    КонецЕсли;
    Возврат Неопределено;
КонецФункции
