Функция ProducerIfConsumerElse(Условие) Экспорт
    Менеджер = Новый МенеджерВременныхТаблиц;
    Продюсер = Новый Запрос;
    Продюсер.МенеджерВременныхТаблиц = Менеджер;
    Продюсер.Текст = "ВЫБРАТЬ Ссылка ПОМЕСТИТЬ ВТ_Ветка ИЗ Справочник.Номенклатура";
    Если Условие Тогда
        Продюсер.Выполнить();
    Иначе
        Потребитель = Новый Запрос;
        Потребитель.МенеджерВременныхТаблиц = Менеджер;
        Потребитель.Текст = "ВЫБРАТЬ Ссылка ИЗ ВТ_Ветка";
        Результат = Потребитель.Выполнить();
    КонецЕсли;
    Возврат Неопределено;
КонецФункции
