Функция АлиасХранитСтарыйЗапрос() Экспорт
    Менеджер = Новый МенеджерВременныхТаблиц;
    Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = Менеджер;
    Запрос.Текст = "ВЫБРАТЬ Ссылка ПОМЕСТИТЬ ВТ_Алиас ИЗ Справочник.Номенклатура";
    СтарыйАлиас = Запрос;
    Запрос = Новый Запрос;
    СтарыйАлиас.Выполнить();
    Потребитель = Новый Запрос;
    Потребитель.МенеджерВременныхТаблиц = Менеджер;
    Потребитель.Текст = "ВЫБРАТЬ Ссылка ИЗ ВТ_Алиас";
    Возврат Потребитель.Выполнить().Выгрузить();
КонецФункции
