Процедура MultilineLoopConditional(Коллекция, Условие) Экспорт
    Для Каждого Элемент
        Из Коллекция Цикл
        Менеджер = Новый МенеджерВременныхТаблиц;
        Продюсер = Новый Запрос;
        Продюсер.МенеджерВременныхТаблиц = Менеджер;
        Продюсер.Текст = "ВЫБРАТЬ Ссылка ПОМЕСТИТЬ ВТ_MultiLoop ИЗ Справочник.Номенклатура";
        Продюсер.Выполнить();
        Если Условие Тогда
            Потребитель = Новый Запрос;
            Потребитель.МенеджерВременныхТаблиц = Менеджер;
            Потребитель.Текст = "ВЫБРАТЬ Ссылка ИЗ ВТ_MultiLoop";
            Результат = Потребитель.Выполнить();
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры
