Функция АлиасМенеджераСохраняетIdentity() Экспорт
    Менеджер = Новый МенеджерВременныхТаблиц;
    АлиасМенеджера = Менеджер;
    Продюсер = Новый Запрос;
    Продюсер.МенеджерВременныхТаблиц = Менеджер;
    Продюсер.Текст = "ВЫБРАТЬ Ссылка ПОМЕСТИТЬ ВТ_АлиасМенеджера ИЗ Справочник.Номенклатура";
    Продюсер.Выполнить();
    Потребитель = Новый Запрос;
    Потребитель.МенеджерВременныхТаблиц = АлиасМенеджера;
    Потребитель.Текст = "ВЫБРАТЬ Ссылка ИЗ ВТ_АлиасМенеджера";
    Возврат Потребитель.Выполнить().Выгрузить();
КонецФункции
