Процедура ПроверитьПозиции()
    ПервыйТекст = "\tВЫБРАТЬ Поле ИЗ Справочник.Номенклатура";
    ПервыйЗапрос = Новый Запрос;
    ПервыйЗапрос.Текст = ПервыйТекст;

    СреднийТекст =
    "ВЫБРАТЬ Поле
    |\nИЗ Справочник.Номенклатура
    |ГДЕ Поле = &Поле";
    СреднийЗапрос = Новый Запрос;
    СреднийЗапрос.Текст = СреднийТекст;

    ПоследнийТекст =
    "ВЫБРАТЬ Поле
    |ИЗ Справочник.Номенклатура
    |ГДЕ Поле = &Поле\r";
    ПоследнийЗапрос = Новый Запрос;
    ПоследнийЗапрос.Текст = ПоследнийТекст;
КонецПроцедуры
