Функция ConditionalManagerRebind(Условие) Экспорт
    Менеджер = Новый МенеджерВременныхТаблиц;
    Продюсер = Новый Запрос;
    Продюсер.МенеджерВременныхТаблиц = Менеджер;
    Продюсер.Текст = "ВЫБРАТЬ Ссылка ПОМЕСТИТЬ ВТ_ManagerBranch ИЗ Справочник.Номенклатура";
    Продюсер.Выполнить();
    Если Условие Тогда
        Менеджер = Новый МенеджерВременныхТаблиц;
    КонецЕсли;
    Потребитель = Новый Запрос;
    Потребитель.МенеджерВременныхТаблиц = Менеджер;
    Потребитель.Текст = "ВЫБРАТЬ Ссылка ИЗ ВТ_ManagerBranch";
    Результат = Потребитель.Выполнить();
    Возврат Результат;
КонецФункции
