Функция MultilineSameBranch(Условие1, Условие2) Экспорт
    Менеджер = Новый МенеджерВременныхТаблиц;
    Если Условие1
        И Условие2 Тогда
        Продюсер = Новый Запрос;
        Продюсер.МенеджерВременныхТаблиц = Менеджер;
        Продюсер.Текст = "ВЫБРАТЬ Ссылка ПОМЕСТИТЬ ВТ_MultiSame ИЗ Справочник.Номенклатура";
        Продюсер.Выполнить();
        Потребитель = Новый Запрос;
        Потребитель.МенеджерВременныхТаблиц = Менеджер;
        Потребитель.Текст = "ВЫБРАТЬ Ссылка ИЗ ВТ_MultiSame";
        Возврат Потребитель.Выполнить().Выгрузить();
    КонецЕсли;
    Возврат Неопределено;
КонецФункции
