Функция ТочкаСЗапятойВТексте() Экспорт
    Менеджер = Новый МенеджерВременныхТаблиц;
    Продюсер = Новый Запрос;
    Продюсер.МенеджерВременныхТаблиц = Менеджер;
    Продюсер.Текст = "ВЫБРАТЬ Ссылка ПОМЕСТИТЬ ВТ_Строка ИЗ Справочник.Номенклатура ГДЕ Наименование = ""A;B""";
    Продюсер.Выполнить();
    Потребитель = Новый Запрос;
    Потребитель.МенеджерВременныхТаблиц = Менеджер;
    Потребитель.Текст = "ВЫБРАТЬ Ссылка ИЗ ВТ_Строка";
    Возврат Потребитель.Выполнить().Выгрузить();
КонецФункции
