Функция ConditionalConsumer(Условие) Экспорт
    Менеджер = Новый МенеджерВременныхТаблиц;
    Продюсер = Новый Запрос;
    Продюсер.МенеджерВременныхТаблиц = Менеджер;
    Продюсер.Текст = "ВЫБРАТЬ Ссылка ПОМЕСТИТЬ ВТ_Условная ИЗ Справочник.Номенклатура";
    Продюсер.Выполнить();
    Если Условие Тогда
        Потребитель = Новый Запрос;
        Потребитель.МенеджерВременныхТаблиц = Менеджер;
        Потребитель.Текст = "ВЫБРАТЬ Ссылка ИЗ ВТ_Условная";
        Результат = Потребитель.Выполнить();
    КонецЕсли;
    Возврат Неопределено;
КонецФункции
