Процедура BreakBarrier(Коллекция) Экспорт
    Для Каждого Элемент Из Коллекция Цикл
        Менеджер = Новый МенеджерВременныхТаблиц;
        Продюсер = Новый Запрос;
        Продюсер.МенеджерВременныхТаблиц = Менеджер;
        Продюсер.Текст = "ВЫБРАТЬ Ссылка ПОМЕСТИТЬ ВТ_Break ИЗ Справочник.Номенклатура";
        Продюсер.Выполнить();
        Прервать;
        Потребитель = Новый Запрос;
        Потребитель.МенеджерВременныхТаблиц = Менеджер;
        Потребитель.Текст = "ВЫБРАТЬ Ссылка ИЗ ВТ_Break";
        Результат = Потребитель.Выполнить();
    КонецЦикла;
КонецПроцедуры
