Функция CompileSameBranch() Экспорт
    Менеджер = Новый МенеджерВременныхТаблиц;
#Если Сервер Тогда
    Продюсер = Новый Запрос;
    Продюсер.МенеджерВременныхТаблиц = Менеджер;
    Продюсер.Текст = "ВЫБРАТЬ Ссылка ПОМЕСТИТЬ ВТ_CompileGood ИЗ Справочник.Номенклатура";
    Продюсер.Выполнить();
    Потребитель = Новый Запрос;
    Потребитель.МенеджерВременныхТаблиц = Менеджер;
    Потребитель.Текст = "ВЫБРАТЬ Ссылка ИЗ ВТ_CompileGood";
    Результат = Потребитель.Выполнить();
    Возврат Результат;
#Иначе
    Возврат Неопределено;
#КонецЕсли
КонецФункции
