Функция ProducerTryConsumerExcept() Экспорт
    Менеджер = Новый МенеджерВременныхТаблиц;
    Продюсер = Новый Запрос;
    Продюсер.МенеджерВременныхТаблиц = Менеджер;
    Продюсер.Текст = "ВЫБРАТЬ Ссылка ПОМЕСТИТЬ ВТ_Try ИЗ Справочник.Номенклатура";
    Попытка
        Продюсер.Выполнить();
    Исключение
        Потребитель = Новый Запрос;
        Потребитель.МенеджерВременныхТаблиц = Менеджер;
        Потребитель.Текст = "ВЫБРАТЬ Ссылка ИЗ ВТ_Try";
        Результат = Потребитель.Выполнить();
    КонецПопытки;
    Возврат Неопределено;
КонецФункции
