Функция InlineConditionalReturn(Условие) Экспорт
    Менеджер = Новый МенеджерВременныхТаблиц;
    Продюсер = Новый Запрос;
    Продюсер.МенеджерВременныхТаблиц = Менеджер;
    Продюсер.Текст = "ВЫБРАТЬ Ссылка ПОМЕСТИТЬ ВТ_InlineReturn ИЗ Справочник.Номенклатура";
    Продюсер.Выполнить();
    Если Условие Тогда Возврат Неопределено; КонецЕсли;
    Потребитель = Новый Запрос;
    Потребитель.МенеджерВременныхТаблиц = Менеджер;
    Потребитель.Текст = "ВЫБРАТЬ Ссылка ИЗ ВТ_InlineReturn";
    Результат = Потребитель.Выполнить();
    Возврат Результат;
КонецФункции
