Процедура ContinueBarrier(Коллекция) Экспорт
    Для Каждого Элемент Из Коллекция Цикл
        Менеджер = Новый МенеджерВременныхТаблиц;
        Продюсер = Новый Запрос;
        Продюсер.МенеджерВременныхТаблиц = Менеджер;
        Продюсер.Текст = "ВЫБРАТЬ Ссылка ПОМЕСТИТЬ ВТ_Continue ИЗ Справочник.Номенклатура";
        Продюсер.Выполнить();
        Продолжить;
        Потребитель = Новый Запрос;
        Потребитель.МенеджерВременныхТаблиц = Менеджер;
        Потребитель.Текст = "ВЫБРАТЬ Ссылка ИЗ ВТ_Continue";
        Результат = Потребитель.Выполнить();
    КонецЦикла;
КонецПроцедуры
